# Pandas DataFrame replace() using where

In [1]:
import pandas as pd

In [19]:
data = pd.DataFrame({"Courses":["Java","Javascript","C++","Python","Flutter"],"Fee":[22000,24000,23000,25000,26000], "Discount":[1500,1000,12000,800,1300], "Duration":['30days', '50days', '30days', '35days', '40days']})

In [20]:
data

      Courses    Fee  Discount Duration
0        Java  22000      1500   30days
1  Javascript  24000      1000   50days
2         C++  23000     12000   30days
3      Python  25000       800   35days
4     Flutter  26000      1300   40days

In [21]:
data["Discount"] = data["Discount"].apply(lambda x: x + x * 30 // 100)

In [22]:
data

      Courses    Fee  Discount Duration
0        Java  22000      1950   30days
1  Javascript  24000      1300   50days
2         C++  23000     15600   30days
3      Python  25000      1040   35days
4     Flutter  26000      1690   40days

In [7]:
# 30 % of value is added to the discount

# Here i want to make select the course which have fees more than 25000 and need to give discount to that particular course

In [23]:
data["Fee"] >= 25000

0    False
1    False
2    False
3     True
4     True
Name: Fee, dtype: bool

In [25]:
data[data["Fee"] >= 25000]

   Courses    Fee  Discount Duration
3   Python  25000      1040   35days
4  Flutter  26000      1690   40days

In [26]:
data.loc[data["Fee"] >= 25000]

   Courses    Fee  Discount Duration
3   Python  25000      1040   35days
4  Flutter  26000      1690   40days

In [12]:
# Both are same

In [13]:
import numpy as np

In [27]:
np.where(data["Fee"] >= 25000, data["Discount"] + data["Discount"] * 30//100, data["Discount"])

array([ 1950,  1300, 15600,  1352,  2197])

In [28]:
data

      Courses    Fee  Discount Duration
0        Java  22000      1950   30days
1  Javascript  24000      1300   50days
2         C++  23000     15600   30days
3      Python  25000      1040   35days
4     Flutter  26000      1690   40days

In [16]:
# See for Flutter alone the discount is added for about 30%

In [29]:
data["Discount"] = np.where(data["Fee"] >= 25000, data["Discount"] + data["Discount"] * 30//100, data["Discount"])

In [30]:
data

      Courses    Fee  Discount Duration
0        Java  22000      1950   30days
1  Javascript  24000      1300   50days
2         C++  23000     15600   30days
3      Python  25000      1352   35days
4     Flutter  26000      2197   40days

In [31]:
np.where((data["Fee"] >= 25000) & (data["Courses"] == "Flutter"), data["Discount"] + data["Discount"] * 30//100, data["Discount"])

array([ 1950,  1300, 15600,  1352,  2856])

In [32]:
data["Discount"] = np.where((data["Fee"] >= 25000) & (data["Courses"] == "Flutter"), data["Discount"] + data["Discount"] * 30//100, data["Discount"])

In [33]:
data

      Courses    Fee  Discount Duration
0        Java  22000      1950   30days
1  Javascript  24000      1300   50days
2         C++  23000     15600   30days
3      Python  25000      1352   35days
4     Flutter  26000      2856   40days